// Українська (Ukrainian)
export default {
  CONTRAST_REPORT: 'Звіт про контрастність',
  REVERSE: 'Змінити місцями',
  SAVE: 'Зберегти',
  UNSAVE: 'Видалити',
  SHARE: 'Поділитися',
  COLOURS: 'Кольори',
  FOREGROUND: 'Передній план',
  BACKGROUND: 'Фон',
  CONTRAST: 'Контраст',
  RESULTS: 'Результати',
  OPEN_FG_PICKER: 'Відкрити вибір кольору переднього плану',
  OPEN_BG_PICKER: 'Відкрити вибір кольору фону',
  FOREGROUND_PICKER: 'Вибір кольору переднього плану',
  BACKGROUND_PICKER: 'Вибір кольору фону',
  FOREGROUND_EYEDROPPER: 'Піпетка переднього плану',
  BACKGROUND_EYEDROPPER: 'Піпетка фону',
  CONTRAST_RATIO: 'Коефіцієнт контрастності',
  PREVIEW: 'Попередній',
  NORMAL_TEXT: 'Звичайний',
  LARGE_TEXT: 'Великий',
  GRAPHICS_AND_UI: 'Графіка',
  GOOD: 'Добре',
  LOW: 'Низький',
  FIX: 'Виправити',
  SETTINGS: 'Налаштування',
  THEME: 'Тема',
  POP_OUT: 'Відкрити окремо',
  SWATCH: 'Зразок: %(foreground) на %(background).',
  SWATCH_SAVED_WINDOW: 'Зразок збережено в головному вікні.',
  LINK_COPIED: 'Посилання скопійовано до буфера обміну!',
  SAVED_COLOURS: 'Збережені кольори',
  EXPLANATION: 'Пояснення',
  ABOUT_THIS_WEBSITE: 'Про цей вебсайт',
  SKIP_TO_SETTINGS: 'Перейти до налаштувань',
  PASSES: 'Пройдено',
  FAILS: 'Не пройдено',
  LANGUAGE: 'Мова',
  NO_COMBO_FOUND:
    'Не вдалося знайти доступну комбінацію, змінюючи колір тексту. Спробуйте змінити колір фону.',
  CONTRAST_NORMAL_GOOD:
    '%(fg) має гарний коефіцієнт контрастності %(ratio):1 із фоном %(bg) для звичайного тексту.',
  CONTRAST_NORMAL_LOW:
    '%(fg) має низький коефіцієнт контрастності %(ratio):1 із фоном %(bg) для звичайного тексту.',
  CONTRAST_LARGE_GOOD:
    '%(fg) має гарний коефіцієнт контрастності %(ratio):1 із фоном %(bg) для великого тексту.',
  CONTRAST_LARGE_LOW:
    '%(fg) має низький коефіцієнт контрастності %(ratio):1 із фоном %(bg) для великого тексту.',
  CONTRAST_GRAPHICS_GOOD:
    '%(fg) має гарний коефіцієнт контрастності %(ratio):1 із фоном %(bg) для графіки та елементів інтерфейсу.',
  CONTRAST_GRAPHICS_LOW:
    '%(fg) має низький коефіцієнт контрастності %(ratio):1 із фоном %(bg) для графіки та елементів інтерфейсу.',
  UNSUPPORTED_COLOUR_SPACE: 'На жаль, цей колірний простір не підтримується!',
  CLOSE_ALERT: 'Закрити сповіщення',
  EXPLANATION_BODY: `<ul>
    <li>WCAG — це абревіатура від Web Content Accessibility Guidelines (Веб-інструкції з доступності контенту).</li>
    <li>WCAG має три рівні: A, AA і AAA. Рівні AA та AAA мають різні вимоги до контрастності.</li>
    <li>Звичайний текст (основний) повинен мати контрастність не менше 4.5:1.</li>
    <li>Великий текст (заголовки) повинен мати контрастність не менше 3:1.</li>
    <li>Великим текстом вважається шрифт 14 пунктів (18.67 пікселів) напівжирний або більше, або 18 пунктів (24 пікселі) чи більше.</li>
    <li>Уся графіка, іконки та елементи інтерфейсу повинні мати контрастність щонайменше 3:1 для рівнів AA і AAA.</li>
  </ul>`,
  ABOUT_BODY: `<p>Створено <a href="https://chaboryk.xyz">Adam Chaboryk</a>.</p>
  <h3>Конфіденційність</h3>
  <p>Цей вебсайт ніколи не збирає особисті дані. Він використовує локальне сховище браузера для запам’ятовування нещодавно використаних комбінацій кольорів. Використовується аналітика, орієнтована на приватність — без відстеження IP-адрес, відбитків чи cookies.</p>
  <h3>Відкритий код</h3>
  <p>Перегляньте <a href="https://github.com/adamchaboryk/contrast.report">вихідний код на GitHub</a>.</p>`,
  SPONSOR: 'Спонсор',
  IMPROVE_TRANSLATION: 'Покращити цей переклад',
};
